//给出一个不多于5位的整数，要求
// 1、求出它是几位数
// 2、分别输出每一位数字
// 3、按逆序输出各位数字，例如原数为321,应输出123
#include <stdio.h>
int main()
{
    int i = 0; //位数
    int t;     //输入的数字
    int k;     //存储每一个位数
    int a[5];
    scanf("%d", &t);
    //不断除以10 每次除一次，位数加1 直到数字变为01为止
    while (t != 0)
    {
        k = t % 10; //每位数字
        a[i] = k;   //存最右边数字
        i++;
        t = t / 10; //把最右边的数字丢掉
    }
    printf("%d\n", i); //位数
    //就用它除以10的i-1次方 再对10取余即可
    for (int j = i - 1; j >= 0; j--)
    {
        printf("%d", a[j]);
    }
    printf("\n");
    for (int j = 0; j < i; j++)
    {
        printf("%d", a[j]);
    }

    return 0;
}
